Autodesk.Revit.DB.ProjectPosition.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ProjectPosition.Angle
Angle from True North.
Remarks:
This is the angle difference between project north and true north measured in
radians. It can have a value from -PI to PI.
If the parameter value is outside that range, it
will be shifted by 2*PI until it falls into range.

Autodesk.Revit.DB.ProjectPosition.Elevation
Elevation above ground level.
Remarks:
Negative values are allowed. Measured in decimal feet.

Autodesk.Revit.DB.ProjectPosition.NorthSouth
North/South offset
Remarks:
The offset of the project location from the site location in
the north/south direction. Measured in decimal feet.

Autodesk.Revit.DB.ProjectPosition.EastWest
East/West offset.
Remarks:
The offset of the project location from the site location in
the east/west direction. Measured in decimal feet.

Autodesk.Revit.DB.ProjectPosition.#ctor(System.Double,System.Double,System.Double,System.Double)
Construct a new ProjectPosition with the specified
East/West offset, North/South offset, elevation offset,
and angle of rotation.
Remarks:
The angle parameter must be in the range of -PI to PI.
If the parameter value is outside that range, it
will be shifted by 2*PI until it falls into range.
ew:
East/West offset
ns:
North/South offset
elevation:
Elevation offset
angle:
Rotation from true north, in radians

Autodesk.Revit.DB.ProjectPosition.#ctor(Autodesk.Revit.DB.ProjectPosition)
Creates a copy of the ProjectPosition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.ProjectPosition
ProjectPosition is a class used to represent a geographical offset and rotation. It can be used to represent the
position of a project.